trade_exp/src/AccumulationRegisters/БонусныеБаллы/БонусныеБаллы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e3cba07e-b273-45b0-98b0-fb46a8dc5694">
  <name>БонусныеБаллы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="c272e1ef-3e78-4217-a586-b04d493ae9c7">
    <name>Начислено</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="045d5c04-a494-4ce1-8feb-c971c832360d">
    <name>НачисленоСтатус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d25ef04e-457d-44fa-8725-25a813516807">
    <name>НачисленоКП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="372f8640-d32c-41d8-b10c-d2f1ae57a694">
    <name>НачисленоПрочее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d3b7c92b-14d3-4a4e-911a-d390d54c81e9">
    <name>КСписанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1758d045-4e77-4376-b4b7-f8c4d0745f49">
    <name>ВРезерве</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="eae49cfa-4bed-4293-959e-c0232deed12d">
    <name>Зарезервировано</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="27ad958d-13f3-4ed5-bfe8-57104e687aa8">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c2ad6036-ba65-416c-b1ec-c8981b70ed01">
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56c44fed-c51a-4f96-8f0e-631f22cadcde">
    <name>ДатаКОбработке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="d465f3dc-4b7b-40a0-970e-da046f213d6d">
    <name>БонуснаяПрограммаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f1f1f3cd-c388-438a-8a49-8e43fd10ced8">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/CommonModules/БонусныеБаллыСервер/Module.bsl
&ИзменениеИКонтроль("ЗаполнитьБонусныеБаллыВозвратТоваровОтКлиента")
Процедура Док_ЗаполнитьБонусныеБаллыВозвратТоваровОтКлиента(ТекущийОбъект)

	УстановитьПривилегированныйРежим(Истина);
	
	#Вставка
		Если ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") Тогда
			ДокументОснование = ТекущийОбъект.ДокументРеализации;
			
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") ИЛИ 
				ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
				БонусыАльтерраРезерв.ЗаполнитьБонусныеБаллыВозвратТоваровОтКлиентаПоРеализации(ТекущийОбъект);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	#КонецВставки

	ТекущийОбъект.НачислениеБонусныхБаллов.Очистить();
	ТекущийОбъект.ОплатаБонуснымиБаллами.Очистить();

	Если ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") Тогда
		ДокументОснование = ТекущийОбъект.ДокументРеализации;

		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах") Тогда
			ТекстЗапроса = ТекстЗапросаВозвратБонусныхБалловРозничныеПродажи();
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ТекстЗапроса = ТекстЗапросаВозвратБонусныхБалловОптовыеПродажи();
		Иначе
			Возврат;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		ДокументОснование = ТекущийОбъект.ДокументОснование;

		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ТекстЗапроса = ТекстЗапросаВозвратБонусныхБалловОптовыеПродажи();
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	Если ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента") Тогда
		Запрос.УстановитьПараметр("СсылкаДокументаВозврат", ТекущийОбъект.Ссылка);
		Запрос.УстановитьПараметр("СсылкаДокументаКорректировка", Документы.КорректировкаРеализации.ПустаяСсылка());
		Запрос.УстановитьПараметр("Товары", ТекущийОбъект.Товары.Выгрузить(,"Номенклатура, Характеристика, Сумма"));
	Иначе
		Запрос.УстановитьПараметр("СсылкаДокументаКорректировка", ТекущийОбъект.Ссылка);
		Запрос.УстановитьПараметр("СсылкаДокументаВозврат", Документы.ВозвратТоваровОтКлиента.ПустаяСсылка());

		Товары = ТекущийОбъект.Расхождения.Выгрузить(,"Номенклатура, Характеристика, Сумма");
		ИндексСтроки = Товары.Количество()-1;

		Пока ИндексСтроки >= 0 Цикл

			ТекущаяСтрока = Товары[ИндексСтроки];

			Если ТекущаяСтрока.Сумма > 0 Тогда
				Товары.Удалить(ТекущаяСтрока);
			Иначе
				ТекущаяСтрока.Сумма = -ТекущаяСтрока.Сумма;
			КонецЕсли;

			ИндексСтроки = ИндексСтроки - 1;

		КонецЦикла;

		Если Товары.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;

		Запрос.УстановитьПараметр("Товары", Товары);
	КонецЕсли;

	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ВалютаДокумента", ТекущийОбъект.Валюта);
	Запрос.УстановитьПараметр("Дата", ТекущийОбъект.Дата);
	Запрос.УстановитьПараметр("Партнер", ТекущийОбъект.Партнер);

	Результаты = Запрос.ВыполнитьПакет();

	ОстаткиНачисленныхБонусныхБаллов = Результаты[1].Выгрузить();
	ОстаткиСписываемыхБонусныхБаллов = Результаты[2].Выгрузить();

	СуммаНачисленныхБалловКВозврату = 0;
	СуммаСписанныхБонусныхБалловКВозврату = 0;

	ВыборкаТовары = Результаты[3].Выбрать();
	Если ВыборкаТовары.Следующий() Тогда

		Если ВыборкаТовары.Сумма <> 0 Тогда
			СуммаНачисленныхБалловКВозврату = ОстаткиНачисленныхБонусныхБаллов.Итог("СуммаБонусныхБаллов")
			* ВыборкаТовары.СуммаВДокументе / ВыборкаТовары.Сумма;

			СуммаСписанныхБонусныхБалловКВозврату = ОстаткиСписываемыхБонусныхБаллов.Итог("СуммаБонусныхБаллов")
			* ВыборкаТовары.СуммаВДокументе / ВыборкаТовары.Сумма;

		КонецЕсли;

	КонецЕсли;

	Для Каждого СтрокаТЧ Из ОстаткиНачисленныхБонусныхБаллов Цикл

		Если СуммаНачисленныхБалловКВозврату = 0 Тогда
			Прервать;
		КонецЕсли;

		Если СуммаНачисленныхБалловКВозврату >= СтрокаТЧ.СуммаБонусныхБаллов Тогда

			СуммаНачисленныхБалловКВозврату = СуммаНачисленныхБалловКВозврату - СтрокаТЧ.СуммаБонусныхБаллов;
			КСписанию = СтрокаТЧ.СуммаБонусныхБаллов;

		Иначе

			КСписанию = СуммаНачисленныхБалловКВозврату;
			СуммаНачисленныхБалловКВозврату = 0;

		КонецЕсли;

		НоваяСтрока = ТекущийОбъект.НачислениеБонусныхБаллов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, "БонуснаяПрограммаЛояльности, ДатаНачисления, ДатаСписания");
		НоваяСтрока.СуммаБонусныхБаллов = КСписанию;

		СтрокаТЧ.СуммаБонусныхБаллов = СтрокаТЧ.СуммаБонусныхБаллов - КСписанию;

	КонецЦикла;

	Для Каждого СтрокаТЧ Из ОстаткиСписываемыхБонусныхБаллов Цикл

		Если СуммаСписанныхБонусныхБалловКВозврату = 0 Тогда
			Прервать;
		КонецЕсли;

		Если СуммаСписанныхБонусныхБалловКВозврату >= СтрокаТЧ.СуммаБонусныхБаллов Тогда

			СуммаСписанныхБонусныхБалловКВозврату = СуммаСписанныхБонусныхБалловКВозврату - СтрокаТЧ.СуммаБонусныхБаллов;
			КСписанию = СтрокаТЧ.СуммаБонусныхБаллов;

		Иначе

			КСписанию = СуммаСписанныхБонусныхБалловКВозврату;
			СуммаСписанныхБонусныхБалловКВозврату = 0;

		КонецЕсли;

		НоваяСтрока = ТекущийОбъект.ОплатаБонуснымиБаллами.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ, "БонуснаяПрограммаЛояльности, ДатаОплаты");
		НоваяСтрока.СуммаБонусныхБаллов = -КСписанию;

		СтрокаТЧ.СуммаБонусныхБаллов = СтрокаТЧ.СуммаБонусныхБаллов - КСписанию;

	КонецЦикла;

КонецПроцедуры

&Вместо("ОстаткиИДвиженияБонусныхБаллов")
Функция Док_ОстаткиИДвиженияБонусныхБаллов(БонуснаяПрограммаЛояльности, Партнер) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	ОстаткиБонусныхБаллов = Новый ТаблицаЗначений;
	ОстаткиБонусныхБаллов.Колонки.Добавить("Период");
	ОстаткиБонусныхБаллов.Колонки.Добавить("Сумма");
	ОстаткиБонусныхБаллов.Колонки.Добавить("Изменение");
	ОстаткиБонусныхБаллов.Колонки.Добавить("ТекущийОстаток");

	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	""Сейчас"" КАК Период,
	|	БонусныеБаллыОстаткиИОбороты.НачисленоОстаток КАК Сумма
	|ПОМЕСТИТЬ НачальныйОстаток
	|ИЗ
	|	РегистрНакопления.БонусныеБаллы.Остатки(
	|			&ДатаНачала,
	|			БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности
	|				И Партнер = &Партнер) КАК БонусныеБаллыОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Сейчас"",
	|	0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачальныйОстаток.Период КАК Период,
	|	СУММА(НачальныйОстаток.Сумма) КАК Сумма
	|ИЗ
	|	НачальныйОстаток КАК НачальныйОстаток
	|
	|СГРУППИРОВАТЬ ПО
	|	НачальныйОстаток.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БонусныеБаллыОстаткиИОбороты.ПериодДень КАК Период,
	|	БонусныеБаллыОстаткиИОбороты.НачисленоКонечныйОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.БонусныеБаллы.ОстаткиИОбороты(
	|			&ДатаНачала,
	|			,
	|			Авто,
	|			Движения,
	|			БонуснаяПрограммаЛояльности = &БонуснаяПрограммаЛояльности
	|				И Партнер = &Партнер) КАК БонусныеБаллыОстаткиИОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период");

	Запрос.УстановитьПараметр("ДатаНачала",                  ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("БонуснаяПрограммаЛояльности", БонуснаяПрограммаЛояльности);
	Запрос.УстановитьПараметр("Партнер",                     Партнер);

	МассивРезультатов = Запрос.ВыполнитьПакет();

	НачальныйОстатокВБаллах = 0;

	// Текущий остаток
	РезультатТекущийОстаток = МассивРезультатов[1];
	Выборка = РезультатТекущийОстаток.Выбрать();
	ТекущийОстаток = 0;
	Пока Выборка.Следующий() Цикл

		НоваяСтрока = ОстаткиБонусныхБаллов.Добавить();
		НоваяСтрока.Период = Выборка.Период;
		НоваяСтрока.Сумма = Выборка.Сумма;
		НачальныйОстатокВБаллах = НоваяСтрока.Сумма;
		ТекущийОстаток = НоваяСтрока.Сумма;
		НоваяСтрока.ТекущийОстаток = Истина;

	КонецЦикла;

	// Списания баллов
	РезультатСписанияБаллов = МассивРезультатов[2];
	Выборка = РезультатСписанияБаллов.Выбрать();
	Пока Выборка.Следующий() Цикл

		Изменение = Выборка.Сумма - ТекущийОстаток;

		Если Изменение = 0 Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ОстаткиБонусныхБаллов.Добавить();
		Если Изменение > 0 Тогда
			НоваяСтрока.Период = НСтр("ru = 'Начисление через'")
			+ " " + СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(Цел((Выборка.Период - ТекущаяДатаСеанса())/(24*60*60)), НСтр("ru = 'день, дня, дней'"))
			+ " " + "("+Формат(Выборка.Период,"ДЛФ=D")+"):"
			+ " " + СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(Изменение, НСтр("ru = 'балл, балла, баллов'"))
		Иначе
			НоваяСтрока.Период = НСтр("ru = 'Списание через'")
			+ " " + СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(Цел((Выборка.Период - ТекущаяДатаСеанса())/(24*60*60)), НСтр("ru = 'день, дня, дней'"))
			+ " " + "("+Формат(Выборка.Период,"ДЛФ=D")+"):"
			+ " " + СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(-Изменение, НСтр("ru = 'балл, балла, баллов'"))
		КонецЕсли;

		НоваяСтрока.Сумма = Выборка.Сумма;
		НоваяСтрока.Изменение = Изменение;
		ТекущийОстаток = Выборка.Сумма; 

	КонецЦикла;

	Возврат ОстаткиБонусныхБаллов;

КонецФункции
